<template>
  <div class="container-fluid  main__company">

        <div class="container-sm header_company">
          <img src="../assets/huawei.jpg" class= "img-responsive" alt="">
          <div class=" header_text">
            <h1> О Huawei</h1>
            <h3>Создаем ценность для наших клиентов.</h3>
            <h3>Способствуем развитию отрасли.</h3>
            <h3>Стимулируем экономический рост.</h3>
          </div>
        </div>
        <div class=" body__company">
          <div class="container-sm">
            <h2>КТО МЫ?</h2>
            <p>
              Компания Huawei, основанная в 1987 году, является ведущим глобальным поставщиком ИКТ-инфраструктуры и интеллектуальных устройств. У нас более 194 000 сотрудников, мы работаем в более чем 170 странах и регионах, обслуживая более трех миллиардов человек по всему миру. Мы стремимся предоставить цифровые технологии каждому человеку, дому и организации для создания полностью подключенного интеллектуального мира. Чтобы реализовать эту цель, мы делаем следующее:
              Помогаем достичь повсеместной «подключенности» и продвигаем равенство в доступе к сетям во всем мире;
              Обеспечиваем максимальную вычислительную мощность, благодаря которой облачные и интеллектуальные технологии могут проникнуть во все отрасли и сферы деятельности человека;
              Создаем цифровые платформы, чтобы помочь всем отраслям и организациям стать более гибкими, эффективными и динамичными;
              Меняем пользовательский опыт с помощью ИИ, делая его его более персонализированным для людей во всех сценариях, будь то дома, на работе или в дороге.
            </p>
            <hr/>
            <p>
              У Huawei надежная система корпоративного управления. Сотрудники, владеющие акциями, избирают 115 представителей для формирования Комиссии наших представителей. Затем эта комиссия избирает председателя совета директоров и остальных 16 директоров. Совет директоров избирает четырех заместителей председателя и трех исполнительных директоров. Три заместителя председателя по очереди исполняют обязанности председателя компании.
              Сменяющийся председатель возглавляет Совет директоров и его Исполнительный комитет, когда он находится в должности. Совет директоров принимает решения по корпоративной стратегии и управлению операциями и является высшим органом, отвечающим за корпоративную стратегию, управление операциями и удовлетворение потребностей клиентов.
              Председатель правления возглавляет комиссию представителей. Как высший руководящий орган Huawei Комиссия принимает решения по основным вопросам компании, таким как распределение прибыли, увеличение капитала и выборы членов Совета директоров и Наблюдательного совета.
            </p>
          </div>
          <div class="container-sm">
            <h1> ОТВЕТСТВЕННАЯ ГРАЖДАНСКАЯ ПОЗИЦИЯ</h1>
            <p>
              Придерживаясь принципов корпоративной гражданской ответственности, Huawei прилагает значительные усилия к преодолению цифрового неравенства. Мы остро осознаем важность той роли, которую телекоммуникации играют в чрезвычайных ситуациях, требующих оперативного реагирования: например, в районах Западной Африки, охваченных эпидемией лихорадки Эбола, во время радиоактивного загрязнения в Японии после цунами и после мощного землетрясения в Сычуане (Китай), когда наши специалисты приложили все усилия к восстановлению сетей связи в пострадавших регионах и обеспечению бесперебойной работы критически важного телекоммуникационного оборудования.
              В рамках содействия устойчивому развитию мы также помогаем добиться успеха новому поколению ИКТ-специалистов с помощью программы Seeds for the Future. Студенты высших учебных заведений получают возможность посетить Китай, пройти обучение и приобрести непосредственный опыт работы в отрасли.
            </p>
          </div>
        </div>
      </div>




</template>

<script>
export default {
  name: "Company"
}
</script>

<style scoped>
.main__company{
  display: grid;
  color: white;
  margin: 100px auto;
  padding: 10px;
}

.header_company img{
  position: relative;
  max-width: 100%;
  background-image: url("../assets/huawei.jpg");
}
.header_text{
  position: marker;
  top:200px;
  left: 100px;
  margin: 0 auto;
}
.body__company{
  display: grid;
}

.header_text{
  position: absolute;
  top:20%;
  left: 10%;

}
.body__company{
  display: grid;
}
/*************************Media**********************/
@media only screen and (max-width : 1360px) {

}
</style>